src/cf/InformationRegisters/уатСостояниеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>уатСостояниеТС</Name>
			<Comment>Состояние ТС (уат)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатСостояниеТС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПоВесу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗагрузкаПоОбъему</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТС</Name>
					<Comment>Транспортное средство</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/уатВидыМоделейТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатВидыМоделейТС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автотранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прицеп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвиационныйТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МорскойТранспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖДТранспорт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияВеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияВеса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Килограмм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тонна</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатЕдиницыИзмеренияОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатЕдиницыИзмеренияОбъема</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МетрКубический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Литр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/уатРазнарядка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатРазнарядка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.уатСостояниеТС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Колонна</Name>
					<Comment>Колонна</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКолонны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>Ответственный</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокТС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВидыОперацияРазнарядка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разнарядка</Name>
					<Comment>Разнарядка</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АдресПрибытия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресПрибытия2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУбытия1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресУбытия2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Comment>Водитель</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПрибытия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяПрибытия2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяУбытия</Name>
							<Comment>Время убытия</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяУбытия2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозвращения</Name>
							<Comment>Дата возвращения</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВыезда</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кондуктор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кондуктор2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Comment>Подразделение</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прицеп1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прицеп2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимРаботыТС</Name>
							<Comment>Режим работы ТС</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатРежимыРаботыТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатМаршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесГруза1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемГруза1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесГруза2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемГруза2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/CommonForms/уатАРМФормаЗаполненияТС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализацияКомпоновщика();
	ВосстановитьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	СохранитьНастройки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	НастройкиКомпоновки = ПолучитьНастройкиКомпоновщикаДанныхЗаказов();
	
	Если ВладелецФормы.ИмяФормы = "Документ.уатРазнарядка.Форма.ФормаДокумента" Тогда
		мсвТС = СформироватьДеревоЗаказовНаСервере(НастройкиКомпоновки, ВладелецФормы.Объект.Дата);
	Иначе
		мсвТС = СформироватьДеревоЗаказовНаСервере(НастройкиКомпоновки, ВладелецФормы.ДатаПланирования);
	КонецЕсли;
	
	Закрыть(мсвТС);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВосстановитьНастройки()
	
	Если ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		СтруктураНастроек = ХранилищеНастроекДанныхФорм.Загрузить("Обработка.уатАРМЛогиста_уэ.Форма.ФормаЗаполненияТС", "ФормаЗаполненияТС_Настройки");
	Иначе 
		СтруктураНастроек = Неопределено;
	КонецЕсли;
	
	Если Не ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("Отбор") Тогда 
		ВосстановитьНастройкиОтбора(СтруктураНастроек.Отбор, КомпоновщикДанныхТС.Настройки.Отбор.Элементы);
	КонецЕсли;
	
	Если СтруктураНастроек.Свойство("Порядок") Тогда 
		Для Каждого ТекПорядок Из СтруктураНастроек.Порядок Цикл 
			Если ТекПорядок = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
				НовПорядок = КомпоновщикДанныхТС.Настройки.Порядок.Элементы.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
			Иначе
				НовПорядок = КомпоновщикДанныхТС.Настройки.Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
				ЗаполнитьЗначенияСвойств(НовПорядок, ТекПорядок);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиОтбора(мсвНастроек, ЭлементыОтбора)
	
	Для Каждого ТекОтбор Из мсвНастроек Цикл 
		Если ТекОтбор.Свойство("Элементы") Тогда 
			НовОтбор = ЭлементыОтбора.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовОтбор, ТекОтбор, "ТипГруппы, Использование");
			
			ВосстановитьНастройкиОтбора(ТекОтбор.Элементы, НовОтбор.Элементы);
			
		Иначе 
			НовОтбор = ЭлементыОтбора.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЗаполнитьЗначенияСвойств(НовОтбор, ТекОтбор);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки()
	
	Если Не ПравоДоступа("СохранениеДанныхПользователя", Метаданные) Тогда 
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураНастроек = Новый Структура("Отбор, Порядок", Новый Массив(), Новый Массив());
	
	ПолучитьНастройкиОтбора(СтруктураНастроек.Отбор, КомпоновщикДанныхТС.Настройки.Отбор.Элементы);
	
	Для Каждого ТекПорядок Из КомпоновщикДанныхТС.Настройки.Порядок.Элементы Цикл 
		Если ТипЗнч(ТекПорядок) = Тип("АвтоЭлементПорядкаКомпоновкиДанных") Тогда
			СтруктураНастроек.Порядок.Добавить(Тип("АвтоЭлементПорядкаКомпоновкиДанных"));
		Иначе
			стрПорядок = Новый Структура();
			стрПорядок.Вставить("Поле",              ТекПорядок.Поле);
			стрПорядок.Вставить("ТипУпорядочивания", ТекПорядок.ТипУпорядочивания);
			стрПорядок.Вставить("Использование",     ТекПорядок.Использование);
			
			СтруктураНастроек.Порядок.Добавить(стрПорядок);
		КонецЕсли;
	КонецЦикла;
	
	ХранилищеНастроекДанныхФорм.Сохранить("Обработка.уатАРМЛогиста_уэ.Форма.ФормаЗаполненияТС", "ФормаЗаполненияТС_Настройки", СтруктураНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиОтбора(мсвНастроек, ЭлементыОтбора)
	
	Для Каждого ТекОтбор Из ЭлементыОтбора Цикл 
		стрОтбор = Новый Структура();
		
		Если ТипЗнч(ТекОтбор) = Тип("ГруппаЭлементовОтбораКомпоновкиДанных") Тогда 
			стрОтбор.Вставить("ТипГруппы",     ТекОтбор.ТипГруппы);
			стрОтбор.Вставить("Элементы",      Новый Массив());
			стрОтбор.Вставить("Использование", ТекОтбор.Использование);
			
			ПолучитьНастройкиОтбора(стрОтбор.Элементы, ТекОтбор.Элементы);
			
		Иначе 
			стрОтбор.Вставить("ЛевоеЗначение",  ТекОтбор.ЛевоеЗначение);
			стрОтбор.Вставить("ВидСравнения",   ТекОтбор.ВидСравнения);
			стрОтбор.Вставить("ПравоеЗначение", ТекОтбор.ПравоеЗначение);
			стрОтбор.Вставить("Использование",  ТекОтбор.Использование);
		КонецЕсли;
		
		мсвНастроек.Добавить(стрОтбор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализацияКомпоновщика()
	
	СхемаКомпоновкиДанных = ПолучитьОбщийМакет("уатКомпоновкаДанныхТС");
	
	// установка параметров компоновки данных
	Для Каждого ТекПараметр Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыДанных.Элементы Цикл 
		Если ТекПараметр.Параметр = Новый ПараметрКомпоновкиДанных("Период") Тогда
			ТекПараметр.Значение = Параметры.ДатаПланирования;
			ТекПараметр.Использование = Истина;
		КонецЕсли;
	КонецЦикла;
	
	НастройкаАлгоритмМаршрутизации = Параметры.НастройкаАлгоритмМаршрутизации;
	
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, УникальныйИдентификатор);
	
	КомпоновщикДанныхТС.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	КомпоновщикДанныхТС.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиКомпоновщикаДанныхЗаказов()
	
	НастройкиКомпоновщикаДанных = КомпоновщикДанныхТС.ПолучитьНастройки();
	
	Возврат НастройкиКомпоновщикаДанных;
	
КонецФункции 

&НаСервере
Функция СформироватьДеревоЗаказовНаСервере(НастройкиКомпоновки, ДатаПланирования)
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных), НастройкиКомпоновки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,, Истина);   
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаДанныхТС = Новый ТаблицаЗначений;     
	ПроцессорВывода.УстановитьОбъект(ТаблицаДанныхТС);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ТаблицаДанныхТС.Свернуть("ТС,Модель,ОбъемКузова,Грузоподъемность,СобственныйВес,ИндексКартинки,ВладелецТС");
	РазрешенныеВидыТС = Новый Массив();
	РазрешенныеВидыТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.АвиационныйТранспорт"));
	РазрешенныеВидыТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.Автотранспорт"));
	РазрешенныеВидыТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.ЖДТранспорт"));
	РазрешенныеВидыТС.Добавить(ПредопределенноеЗначение("Перечисление.уатВидыМоделейТС.МорскойТранспорт"));
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ТаблицаДанныхТС",   ТаблицаДанныхТС);
	Запрос.УстановитьПараметр("ДатаПланирования",  ДатаПланирования);
	Запрос.УстановитьПараметр("РазрешенныеВидыТС", РазрешенныеВидыТС);
	Запрос.УстановитьПараметр("ЯндексМаршрутизация", НастройкаАлгоритмМаршрутизации = 3);
	
	Если Константы.уатЕдиницаИзмеренияВеса.Получить() = Перечисления.уатЕдиницыИзмеренияВеса.Килограмм Тогда 
		Запрос.УстановитьПараметр("КоэфГрузоподъемности", 1000);
	Иначе 
		Запрос.УстановитьПараметр("КоэфГрузоподъемности", 1);
	КонецЕсли;
	
	Если Константы.уатЕдиницаИзмеренияОбъема.Получить() = Перечисления.уатЕдиницыИзмеренияОбъема.Литр Тогда 
		Запрос.УстановитьПараметр("КоэфОбъемаКузова", 1000);
	Иначе 
		Запрос.УстановитьПараметр("КоэфОбъемаКузова", 1);
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫРАЗИТЬ(ВТ_ТС.ТС КАК Справочник.уатТС) КАК ТС,
	|	ВЫРАЗИТЬ(ВТ_ТС.Модель КАК Справочник.уатМоделиТС) КАК Модель,
	|	ВТ_ТС.ОбъемКузова КАК ОбъемКузова,
	|	ВТ_ТС.Грузоподъемность КАК Грузоподъемность,
	|	ВТ_ТС.СобственныйВес КАК СобственныйВес,
	|	ВТ_ТС.ИндексКартинки КАК ИндексКартинки,
	|	ВТ_ТС.ВладелецТС КАК ВладелецТС
	|ПОМЕСТИТЬ ВТ_СписокТС
	|ИЗ
	|	&ТаблицаДанныхТС КАК ВТ_ТС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	уатСостояниеТС.Регистратор КАК Регистратор,
	|	уатСостояниеТС.ТС КАК ТС
	|ПОМЕСТИТЬ ВТ_СрезМаршрутныхЛистов
	|ИЗ
	|	РегистрСведений.уатСостояниеТС КАК уатСостояниеТС
	|ГДЕ
	|	уатСостояниеТС.Период <= КОНЕЦПЕРИОДА(&ДатаПланирования, ДЕНЬ)
	|	И уатСостояниеТС.ДатаОкончания >= НАЧАЛОПЕРИОДА(&ДатаПланирования, ДЕНЬ)
	|	И уатСостояниеТС.Регистратор ССЫЛКА Документ.уатМаршрутныйЛист
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СписокТС.ТС КАК ТС,
	|	ВТ_СписокТС.Модель КАК Модель,
	|	ВЫБОР
	|		КОГДА ВТ_СписокТС.ТС.ОбъемКузова <> 0 И &ЯндексМаршрутизация
	|			ТОГДА ВТ_СписокТС.ТС.ОбъемКузова * &КоэфОбъемаКузова
	|		ИНАЧЕ ВТ_СписокТС.Модель.ОбъемКузова * &КоэфОбъемаКузова
	|	КОНЕЦ КАК ОбъемКузова,
	|	ВЫБОР
	|		КОГДА ВТ_СписокТС.ТС.МаксимальноеКоличествоУпаковок <> 0 И &ЯндексМаршрутизация
	|			ТОГДА ВТ_СписокТС.ТС.МаксимальноеКоличествоУпаковок
	|		ИНАЧЕ ВТ_СписокТС.Модель.МаксимальноеКоличествоУпаковок
	|	КОНЕЦ КАК МаксимальноеКоличествоУпаковок,
	|	ВЫБОР
	|		КОГДА ВТ_СписокТС.ТС.Грузоподъемность <> 0 И &ЯндексМаршрутизация
	|			ТОГДА ВТ_СписокТС.ТС.Грузоподъемность * &КоэфГрузоподъемности
	|		ИНАЧЕ ВТ_СписокТС.Модель.Грузоподъемность * &КоэфГрузоподъемности
	|	КОНЕЦ КАК Грузоподъемность,
	|	ВТ_СписокТС.СобственныйВес КАК СобственныйВес,
	|	ВТ_СписокТС.ИндексКартинки КАК ИндексКартинки,
	|	ВТ_СписокТС.ВладелецТС КАК ВладелецТС,
	|	ЕСТЬNULL(ВТ_СрезМаршрутныхЛистов.Регистратор, ЗНАЧЕНИЕ(Документ.уатМаршрутныйЛист.ПустаяСсылка)) КАК МаршрутныйЛист,
	|	ВТ_СписокТС.ТС.Наименование КАК ПредставлениеТС,
	|	ВТ_СписокТС.Модель.Наименование КАК НаименованиеМодели,
	|	ВТ_СписокТС.ТС.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_СписокТСрегистраторМЛ
	|ИЗ
	|	ВТ_СписокТС КАК ВТ_СписокТС
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрезМаршрутныхЛистов КАК ВТ_СрезМаршрутныхЛистов
	|		ПО ВТ_СписокТС.ТС = ВТ_СрезМаршрутныхЛистов.ТС
	|ГДЕ
	|	ВТ_СписокТС.ТС.ВидМоделиТС В(&РазрешенныеВидыТС)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_СписокТСрегистраторМЛ.ТС КАК ТС,
	|	ВТ_СписокТСрегистраторМЛ.ТС.ПринадлежностьТС КАК ПринадлежностьТС,
	|	ВТ_СписокТСрегистраторМЛ.Модель КАК МодельТС,
	|	ВТ_СписокТСрегистраторМЛ.ОбъемКузова КАК ОбъемКузова,
	|	ВТ_СписокТСрегистраторМЛ.Грузоподъемность КАК Грузоподъемность,
	|	ВТ_СписокТСрегистраторМЛ.СобственныйВес КАК СобственныйВес,
	|	ВТ_СписокТСрегистраторМЛ.ИндексКартинки КАК ИндексКартинки,
	|	ВТ_СписокТСрегистраторМЛ.ВладелецТС КАК ВладелецТС,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист КАК МаршрутныйЛист,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.Номер КАК МаршрутныйЛистНомер,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.Дата КАК МаршрутныйЛистДата,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.ВесБрутто КАК МаршрутныйЛистВесБрутто,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.Объем КАК МаршрутныйЛистОбъем,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.КоличествоМест КАК МаршрутныйЛистКоличествоМест,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.Расстояние КАК МаршрутныйЛистРасстояние,
	|	ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист.ВремяВПути КАК МаршрутныйЛистВремяВПути,
	|	уатМаршрутныйЛист.Заказы.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		GUIDСтроки КАК GUIDСтроки,
	|		ВесБрутто КАК ВесБрутто,
	|		Время КАК Время,
	|		Выполнен КАК Выполнен,
	|		ДатаВыполнения КАК ДатаВыполнения,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|		ЕдиницаИзмеренияПоЗаказу КАК ЕдиницаИзмеренияПоЗаказу,
	|		ЗаказГрузоотправителя КАК ЗаказГрузоотправителя,
	|		Количество КАК Количество,
	|		КоличествоМест КАК КоличествоМест,
	|		Контрагент КАК Контрагент,
	|		Номенклатура КАК Номенклатура,
	|		Объем КАК Объем,
	|		ПрибытиеПлан КАК ПрибытиеПлан,
	|		ПрибытиеФакт КАК ПрибытиеФакт,
	|		Пункт КАК Пункт,
	|		Расстояние КАК Расстояние,
	|		Стоянка КАК Стоянка,
	|		СтоянкаИзПункта КАК СтоянкаИзПункта,
	|		ТипТочкиМаршрута КАК ТипТочкиМаршрута,
	|		УбытиеПлан КАК УбытиеПлан,
	|		УбытиеФакт КАК УбытиеФакт
	|	) КАК Заказы,
	|	ВТ_СписокТСрегистраторМЛ.ПредставлениеТС КАК ПредставлениеТС,
	|	ВТ_СписокТСрегистраторМЛ.НаименованиеМодели КАК НаименованиеМодели,
	|	ВТ_СписокТСрегистраторМЛ.Организация КАК Организация,
	|	1 КАК КоличествоВиртуальныхТС,
	|	ВТ_СписокТСрегистраторМЛ.МаксимальноеКоличествоУпаковок КАК МаксимальноеКоличествоУпаковок,
	|	ВТ_СписокТСрегистраторМЛ.ТС.Гараж КАК ГаражТС,
	|	ВТ_СписокТСрегистраторМЛ.ТС.Гараж.Лат КАК ГаражТСЛат,
	|	ВТ_СписокТСрегистраторМЛ.ТС.Гараж.Лон КАК ГаражТСЛон,
	|	ВТ_СписокТСрегистраторМЛ.Модель.МинимальноеКоличествоУпаковок КАК МинимальноеКоличествоУпаковок,
	|	ВТ_СписокТСрегистраторМЛ.Модель.МинимальныйВесГруза * &КоэфГрузоподъемности КАК МинимальныйВесГруза,
	|	ВТ_СписокТСрегистраторМЛ.Модель.МинимальныйОбъемГруза * &КоэфОбъемаКузова КАК МинимальныйОбъемГруза,
	|	ВТ_СписокТСрегистраторМЛ.ТС.Характеристики.(
	|		Характеристика КАК ТСХарактеристика
	|	) КАК ХарактеристикиТС
	|ИЗ
	|	ВТ_СписокТСрегистраторМЛ КАК ВТ_СписокТСрегистраторМЛ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.уатМаршрутныйЛист КАК уатМаршрутныйЛист
	|		ПО ВТ_СписокТСрегистраторМЛ.МаршрутныйЛист = уатМаршрутныйЛист.Ссылка";
	
	ВыгрузкаТС = Запрос.Выполнить().Выгрузить();
	ВыгрузкаТС.Колонки.Добавить("ПредставлениеМЛ",       Новый ОписаниеТипов("Строка"));
		
	мсвТС = ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(ВыгрузкаТС);

	Для Каждого ТекСтрока Из мсвТС Цикл
		мсвВрем = ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(ТекСтрока.Заказы);
		мсвВремХарки = ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(ТекСтрока.ХарактеристикиТС);
		ТекСтрока.Заказы = мсвВрем;
		ТекСтрока.ХарактеристикиТС = мсвВремХарки;
		ТекСтрока.ПредставлениеМЛ = СтрШаблон(Нстр("ru = '%1 от %2'; en = '%1 from %2'"), ТекСтрока.МаршрутныйЛистНомер,
				ТекСтрока.МаршрутныйЛистДата); 
	КонецЦикла;
	
	Возврат мсвТС;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПреобразоватьТаблицуВМассивДляПередачиНаКлиент(тбл)
	мсв = Новый Массив;
	
	Для Каждого ТекСтрока Из тбл Цикл
		СтруктураСтроки = Новый Структура();
		Для Каждого ТекКолонка Из тбл.Колонки Цикл
			СтруктураСтроки.Вставить(ТекКолонка.Имя, ТекСтрока[ТекКолонка.Имя]);
		КонецЦикла;
		
		мсв.Добавить(СтруктураСтроки);
	КонецЦикла;
	
	Возврат мсв;
КонецФункции

#КонецОбласти
